app/Http/Controllers/Admin/Common/Products.php

select count(*) as aggregate from `products`
---
    public function dataProcessing(Request $request)
    {
        $edit_product = SM::check_this_method_access('products', 'edit') ? 1 : 0;
        $product_status_update = SM::check_this_method_access('products', 'product_status_update') ? 1 : 0;
        $delete_product = SM::check_this_method_access('products', 'delete') ? 1 : 0;
        $per = $edit_product + $delete_product;

        $columns = array(
            0 => 'id',
            1 => 'title',
        );

        $totalData = Product::count();
        $limit = $request->input('length');
        $start = $request->input('start');
        $order = $columns[$request->input('order.0.column')];
        $dir = $request->input('order.0.dir');

        if (empty($request->input('search.value'))) {
            $products = Product::offset($start)
                ->limit($limit)
                //->orderBy($order, $dir)
                ->orderBy('id', 'desc')
                ->get();
            // dd($products);
            $totalFiltered = Product::count();

select * from `reviews` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `reviews`
---
    public function reviews()
    {
        $data["reviews"] = Review::latest()
            ->paginate(config("constant.smPagination"));