app/Http/Controllers/Front/CartController.php

select * from `products` where `products`.`id` = '137' limit 1
select * from `attribute_product` where `product_id` = '137' and `attribute_id` = '1' and `color_id` = '23' limit 1
---
    public function add_to_cart(Request $request)
    {
        if ($request->ajax()) {
            $output = array();
            $id = $request->product_id;
            $qty = $request->qty;
            $product_attribute_size = $request->product_attribute_size;
            $product_attribute_color = $request->product_attribute_color;
            $sizename = $request->sizename;
            $colorname = $request->colorname;
            $product_info = Product::find($id);

            if ($product_info->product_type == 2) {
                $attribute_product = AttributeProduct::where('product_id', $id)->where('attribute_id', $product_attribute_size)->where('color_id', $product_attribute_color)->first();