app/Http/Controllers/Front/CheckoutController.php

    public function checkout()
    {
        $data["cart"] = Cart::instance('cart')->content();
        if (count($data["cart"]) > 0) {
            if (empty(session('step'))) {
                session(['step' => '0']);
            }
            $data['shipping_methods'] = ShippingMethod::Published()->get();
            $data['payment_methods'] = Payment_method::Published()->get();
            $data["sub_total"] = Cart::instance('cart')->subTotal();
            $noraml_discount = Coupon::Published()->where('discount_type', 1)->where('validity', '>=', Carbon::now()->toDateString())->first();
---
select * from `coupons` where `status` = '1' and `discount_type` = '1' and `validity` >= '2024-10-19' limit 1

    public function couponCheck(Request $request)
    {
        $this->validate($request, ['coupon_code' => 'required']);
        $sub_total_price = $request->sub_total_price;

        $coupon = Coupon::where("coupon_code", $request->coupon_code)->first();
---
select * from `coupons` where `coupon_code` = '123' limit 1