app/Http/Controllers/Front/Dashboard.php

select * from `wishlists` where `user_id` = '78' order by `id` desc limit 10 offset 0
select count(*) as aggregate from `wishlists` where `user_id` = '78'
---
    public function wishlist()
    {
        $data['activeMenu'] = 'wishlist';
        $data["userInfo"] = \Auth::user();
        $order_posts_per_page = SM::smGetThemeOption("order_posts_per_page", config('constant.smPagination'));

        $data["wishlists"] = Wishlist::where("user_id", Auth::id())
            ->orderBy("id", 'desc')
            ->paginate($order_posts_per_page);