app/Http/Controllers/Front/ProductController.php

select count(*) as aggregate from `products` inner join `categoryables` on `products`.`id` = `categoryables`.`categoryable_id` left join `attribute_product` on `products`.`id` = `attribute_product`.`product_id` where `categoryables`.`categoryable_type` = 'App\Model\Common\Product' and `products`.`regular_price` between '150' and '2550' group by `products`.`id`
---
                ->join('categoryables', 'products.id', 'categoryables.categoryable_id')
                ->leftJoin('attribute_product', 'products.id', 'attribute_product.product_id')
                ->where('categoryables.categoryable_type', 'App\Model\Common\Product')
                ->select('products.*')
                ->when($brand_filter, function ($query) use ($brand_filter) {
                    if ($brand_filter != "") {
                        return $query->whereIn('products.brand_id', $brand_filter);
                    }
                })
                ->when($category_filter, function ($query) use ($category_filter) {
                    if ($category_filter != "") {
                        return $query->whereIn('categoryables.category_id', $category_filter);
                    }
                })
                ->when($minimum_price, function ($query) use ($minimum_price, $maximum_price) {
                    if ($minimum_price != "" && $maximum_price != "") {
                        return $query->whereBetween('products.regular_price', array($minimum_price, $maximum_price));
                    }
                })
                ->when($size_filter, function ($query) use ($size_filter) {
                    if ($size_filter != "") {
                        return $query->whereIn('attribute_product.attribute_id', $size_filter);
                    }
                })
                ->when($color_filter, function ($query) use ($color_filter) {
                    if ($color_filter != "") {
                        return $query->whereIn('attribute_product.color_id', $color_filter);
                    }
                })
                ->when($orderBy, function ($query) use ($orderBy) {
                    if ($orderBy != "") {
                        return $query->orderBy('products.regular_price', $orderBy);
                    } else {
                        return $query->orderBy('products.id', 'desc');
                    }
                })

select * from `attribute_product` inner join `attributes` on `attribute_product`.`attribute_id` = `attributes`.`id` where `product_id` = '137' and `color_id` = '22' group by `attribute_id`
---
    public function product_color_by_size(Request $request)
    {
        if ($request->ajax()) {
            $product_id = $request->product_id;
            $color_id = $request->color_id;
            $activeSize = $request->activeSize;
            $output = "";

            $attribute_product = DB::table('attribute_product')
                ->join('attributes', 'attribute_product.attribute_id', 'attributes.id')
                ->where('product_id', $product_id)
                ->where('color_id', $color_id)
                ->groupBy('attribute_id')
                ->get();