app/Http/Controllers/Api/BrandController.php

select * from `brands` order by `id` desc
---
    public function getBrands()
    {
        try {
            $brands = Brand::orderBy('id', 'desc')->get();