app/Http/Controllers/Api/CategoryController.php

    public function getCategory()
    {
        try {
            $categories = Category::where("parent_id", 0)
                ->orderBy("id", "desc")
                ->get();
---
select * from `categories` where `parent_id` = '0' order by `id` desc

    public function categoryWiseProduct(Request $request)
    {
        try {
            $category_id = $request->category_id;

            $categoryWiseProduct = Category::findOrFail($category_id);
---
select * from `categories` where `categories`.`id` = '14' limit 1