app/Http/Controllers/Api/CheckOutController.php

    public function runningOrders()
    {
        try {
            $user_id = Auth::id();

            if (empty($user_id)) {
                return response()->json(['error' => 'User ID is required.'], 400);
            }

            $runningOrders = Order::where('user_id', $user_id)
                ->where(function ($query) {
                    $query->where('order_status', 2)
                        ->orWhere('order_status', 3)
                        ->orWhere('order_status', 4);
                })
                ->with('user')
                ->with('detail')
                ->paginate(10);


            foreach ($runningOrders as $order) {
                foreach ($order->detail as $detail) {
                    $product = Product::find($detail->product_id);
---
select * from `users` where `users`.`id` in ('78')
select * from `products` where `products`.`id` = '9' limit 1