app/Http/Controllers/Api/CheckOutController.php

                $order->payment_status = 2;


                $order->save();
---
insert into `orders` (`user_id`, `contact_email`, `cart_json`, `coupon_code`, `sub_total`, `discount`, `tax`, `coupon_amount`, `grand_total`, `payment_method_id`, `transaction_id`, `order_note`, `order_status`, `payment_status`, `updated_at`, `created_at`) values ('78', 'anam123@gmail.com', '[{\"id\":9,\"name\":\"api test product product 333\",\"qty\":2,\"options\":{\"image\":\"https:\/\/example.com\/product1.jpg\",\"sizename\":\"M\",\"colorname\":\"red\"},\"price\":150},{\"id\":137,\"name\":\"api test product product 555\",\"qty\":2,\"options\":{\"image\":\"https:\/\/example.com\/product1.jpg\",\"sizename\":\"M\",\"colorname\":\"blue\"},\"price\":150}]', 'SALE2024', '450', '30', '50', '20', '500', '6', 'sslcommerz-67133f6fcea632.57633684', 'Please deliver between 9am-5pm.', '3', '2', '2024-10-19 11:11:11', '2024-10-19 11:11:11')

            $order->payment_status = 2;


            $order->save();
---
update `orders` set `transaction_id` = '', `updated_at` = '2024-10-19 11:11:12' where `id` = '194'

                    $product = Product::findOrFail($pro['id']);
                    $product->decrement('product_qty', $pro['qty']);
                } else {
                    $product = Product::findOrFail($pro['id']);
                    $product->decrement('product_qty', $pro['qty']);
                }

                // Decrement stock for product attributes (size/color)
                $attributeProduct = AttributeProduct::where('product_id', $pro['id'])
                    ->first();
                if ($attributeProduct instanceof AttributeProduct) {
                    $attributeProduct->decrement('attribute_qty', $pro['qty']);
---
select * from `products` where `products`.`id` = '9' limit 1
update `products` set `product_qty` = `product_qty` - 2, `updated_at` = '2024-10-19 11:11:12' where `id` = '9'
select * from `attribute_product` where `product_id` = '9' limit 1
update `attribute_product` set `attribute_qty` = `attribute_qty` - 2, `updated_at` = '2024-10-19 11:11:12' where `id` = '1'

    public function runningOrders()
    {
        try {
            $user_id = Auth::id();

            if (empty($user_id)) {
                return response()->json(['error' => 'User ID is required.'], 400);
            }

            $runningOrders = Order::where('user_id', $user_id)
                ->where(function ($query) {
                    $query->where('order_status', 2)
                        ->orWhere('order_status', 3)
                        ->orWhere('order_status', 4);
                })
                ->with('detail')
                ->paginate(10);
---
select * from `orders` where `user_id` = '115' and (`order_status` = '2' or `order_status` = '3' or `order_status` = '4') limit 10 offset 0
select count(*) as aggregate from `orders` where `user_id` = '115' and (`order_status` = '2' or `order_status` = '3' or `order_status` = '4')

    public function orderHistory()
    {
        try {
            $user_id = Auth::id();

            if (empty($user_id)) {
                return response()->json(['error' => 'User ID is required.'], 400);
            }
            $orderHistory = Order::where('user_id', $user_id)
                ->where('order_status', 1)
                ->with('detail')
                ->paginate(10);
---
select count(*) as aggregate from `orders` where `user_id` = '115' and `order_status` = '1'

    public function orderDetails(Request $request)
    {
        try {
            $orderId = $request->input('order_id');

            if (empty($orderId)) {
                return response()->json(['error' => 'Order ID is required.'], 400);
            }

            $order = Order::find($orderId);

            if (!$order instanceof Order) {
                return response()->json(['error' => 'Order not found.'], 404);
            }

            $order->load('detail');

            if ($order->detail === null) {
                return response()->json(['error' => 'Order detail not found.'], 404);
            }

            $products = $order->detail;

            foreach ($products as $product) {
                if ($product->product === null) {
                    return response()->json(['error' => 'Product not found for order detail.'], 404);
                }

                $productModel = Product::find($product->product_id);
---
select * from `orders` where `orders`.`id` = '21' limit 1
select * from `products` where `products`.`id` = '135' limit 1