app/Http/Controllers/Api/CouponController.php

select * from `coupons` where `coupon_code` is null limit 1
---
    public function couponDetails(Request $request)
    {
        // dd($request->coupon_code);
        try {
            $coupon = Coupon::where('coupon_code', $request->coupon_code)->first();