app/Http/Controllers/Api/ProductController.php

select * from `products` where `status` = '1' order by `views` desc limit 10 offset 0
select count(*) as aggregate from `products` where `status` = '1'
---
    public function getPopularProducts(Request $request)
    {
        try {
            $popularProducts = Product::where('status', 1)
                ->orderBy('views', 'desc')
                ->paginate(10);

select * from `products` where `status` = '1' order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `products` where `status` = '1'
---
    public function getLatestProducts(Request $request)
    {
        try {
            $latestProducts = Product::where('status', 1)
                ->latest()
                ->paginate(15);

select count(*) as aggregate from `order_details` inner join `products` on `products`.`id` = `order_details`.`product_id` group by `products`.`id`
select products.*, SUM(order_details.product_qty) as total_sold from `order_details` inner join `products` on `products`.`id` = `order_details`.`product_id` group by `products`.`id` order by `total_sold` desc limit 15 offset 0
---
    public function getBestSellingProducts(Request $request)
    {
        try {
            $bestSellingProducts = DB::table('order_details')
                ->selectRaw('products.*, SUM(order_details.product_qty) as total_sold')
                ->join('products', 'products.id', '=', 'order_details.product_id')
                ->groupBy('products.id')
                ->orderBy('total_sold', 'desc')
                ->paginate(15);

select * from `brands` where `brands`.`id` in ('1')
select * from `products` where `id` = '134' limit 1
select * from `units` where `units`.`id` in ('1')
update `products` set `views` = '1064', `updated_at` = '2024-10-20 09:30:19' where `id` = '134'
---
    public function productDetails(Request $request)
    {
        try {
            $product = Product::where('id', $request->product_id)->with('categories', 'brand', 'units')->first();
            $product->append('star_rating');

            if ($product === null) {
                return response()->json([
                    'error' => 'Product not found.',
                ], 404);
            }
            // Check for null pointer references
            if ($product->views === null) {
                $product->views = 0;
            }
            $product->views = $product->views + 1;
            $product->save();

select `id`, `title`, `sku`, `image` from `products` where LOWER(REGEXP_REPLACE(title, "[^a-zA-Z0-9]", "")) like '%anket%' or LOWER(REGEXP_REPLACE(sku, "[^a-zA-Z0-9]", "")) like '%anket%' limit 10
---
    public function searchSuggestions(Request $request)
    {
        try {
            $search = $request->search;

            if ($search == null || $search == '') {
                return response()->json([
                    'status' => 'error',
                    'message' => 'Search field is empty'
                ], 400);
            }

            // Convert search term to lowercase and remove spaces/special characters
            $search = strtolower(preg_replace('/[^a-zA-Z0-9]/', '', $search));

            // Limit the suggestions to 10 results for performance
            $suggestions = Product::whereRaw('LOWER(REGEXP_REPLACE(title, "[^a-zA-Z0-9]", "")) like ?', ['%' . $search . '%'])
                ->orWhereRaw('LOWER(REGEXP_REPLACE(sku, "[^a-zA-Z0-9]", "")) like ?', ['%' . $search . '%'])
                ->select('id', 'title', 'sku', 'image')
                ->take(10)
                ->get();

select * from `reviews` where `product_id` = '60'
---
    public function getProductReviews(Request $request)
    {
        try {
            $product_id = $request->product_id;
            $reviews = Review::where('product_id', $product_id)->with('user')->get();