app/Http/Controllers/Api/ProductController.php

select * from `reviews` where `product_id` = '9'
select sum(`rating`) as aggregate from `reviews` where `product_id` = '9'
---
    public function getLatestProducts(Request $request)
    {
        try {
            // Fetch latest products with status = 1
            $latestProducts = Product::where('status', 1)
                ->latest()
                ->paginate(15);

            // Get product IDs for reviews aggregation
            $productIds = $latestProducts->pluck('id')->toArray();

            // Fetch reviews data for these products in bulk
            $reviewsData = Review::selectRaw('product_id, COUNT(*) as reviewsCount, SUM(rating) as totalRating')
                ->whereIn('product_id', $productIds)
                ->groupBy('product_id')
                ->get()
                ->keyBy('product_id');