app/Http/Controllers/Api/ProfileController.php

    public function getProfile()
    {
        if (auth()->user() === null) {
            return response()->json(['error' => 'Unauthorized'], 401);
        }
        $user = auth()->user();

        if ($user === null) {
            return response()->json(['error' => 'User not found'], 404);
        }

        try {
            $orders = Order::where('user_id', $user->id)->with('detail')->get();
            $completedOrders = Order::where('user_id', $user->id)->where('order_status', 1)->count();
            $processingOrders = Order::where('user_id', $user->id)->where('order_status', 2)->count();
            $pendingOrders = Order::where('user_id', $user->id)->where('order_status', 3)->count();
            $cancelledOrders = Order::where('user_id', $user->id)->where('order_status', 4)->count();
---
select * from `orders` where `user_id` = '115'
select count(*) as aggregate from `orders` where `user_id` = '115' and `order_status` = '1'
select count(*) as aggregate from `orders` where `user_id` = '115' and `order_status` = '2'
select count(*) as aggregate from `orders` where `user_id` = '115' and `order_status` = '3'
select count(*) as aggregate from `orders` where `user_id` = '115' and `order_status` = '4'

    public function deliveryAddress(Request $request)
    {
        if (auth()->user() === null) {
            return response()->json(['error' => 'Unauthorized'], 401);
        }
        $user = auth()->user();
        if ($user === null) {
            return response()->json(['error' => 'User not found'], 404);
        }

        try {
            $user = User::find($user->id);
---
select * from `users` where `users`.`id` = '115' limit 1