app/Http/Controllers/Api/wishlistController.php

select * from `products` where `products`.`id` in ('137')
select * from `wishlists` where `user_id` = '115'
---
    public function get_wishlist()
    {
        try {
            $wishlists = Wishlist::where('user_id', Auth::id())->with('product')->get();