app/Model/Common/Product.php

    public function getReviewsRatingAttribute()
    {
        $reviewData = $this->reviews()->selectRaw('SUM(rating) as totalRating, COUNT(rating) as reviewsCount')->first();
---
select count(*) as aggregate from `reviews` where `reviews`.`product_id` = '137' and `reviews`.`product_id` is not null