app/Http/Controllers/Api/Auth/ApiAuthController.php

    public function login(Request $request)
    {
        // Validate that either username, email, or mobile is required, and password is mandatory
        $validator = Validator::make($request->all(), [
            'username' => 'required_without_all:email,mobile',
            'email' => 'required_without_all:username,mobile',
            'mobile' => 'required_without_all:email,username',
            'password' => 'required',
        ]);

        if ($validator->fails()) {
            return response()->json(['error' => $validator->messages()], 400);
        }

        try {
            // Check login using email and password
            if ($request->has('email') && Auth::guard('web')->attempt(['email' => $request->email, 'password' => $request->password], $request->remember)) {
                $user = User::where('email', $request->email)->where('status', 1)->first();
            }
            // Check login using username and password
            elseif ($request->has('username') && Auth::guard('web')->attempt(['username' => $request->username, 'password' => $request->password], $request->remember)) {
                $user = User::where('username', $request->username)->where('status', 1)->first();
            }
            // Check login using mobile and password
            elseif ($request->has('mobile') && Auth::guard('web')->attempt(['mobile' => $request->mobile, 'password' => $request->password], $request->remember)) {
                $user = User::where('mobile', $request->mobile)->where('status', 1)->first();
---
select * from `users` where `mobile` = '+8801645618975' and `status` = '1' limit 1