app/SM/SM_Admin.php

select * from `roles` where `roles`.`id` = '1' limit 1
---
	public static function current_user_permission_array() {
		if ( static::$currentUserPermissionResult ) {
			$result = static::$currentUserPermissionResult;
		} else {
//			Debugbar::info( "current_user_permission_array else " );
			$result = static::$currentUserPermissionResult = Role::find( self::current_user_role() );

select * from `admins_metas` where `admin_id` = '1' and `meta_key` = 'user_online_status' limit 1
---
	public static function update_user_meta( $user_id, $meta_key, $meta_value ) {
		$admin_meta = Admins_meta::where( 'admin_id', $user_id )
		                         ->where( 'meta_key', $meta_key )
		                         ->first();